weekly-exercises/04.tex
% Created 2019-03-31 Sun 13:12
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper, margin=2cm]{geometry}
\usepackage{indentfirst}
\usepackage[, brazilian]{babel}
\usepackage{float}
\usepackage{color, colortbl}
\usepackage{titling}
\setlength{\droptitle}{-1.5cm}
\hypersetup{ colorlinks = true, urlcolor = blue }
\usemintedstyle{murphy}
\definecolor{beige}{rgb}{0.93,0.93,0.82}
\definecolor{brown}{rgb}{0.4,0.2,0.0}
\author{Fernanda Guimarães - 2016058166}
\date{}
\title{Exercício 04 - (entrega 01/04)}
\hypersetup{
 pdfauthor={Fernanda Guimarães - 2016058166},
 pdftitle={Exercício 04 - (entrega 01/04)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2)}, 
 pdflang={Brazilian}}
\begin{document}

\maketitle

\section{Q1}
\label{sec:org06e0f28}
O Sprint pode ser cancelado antes que o tempo do Sprint termine. Apenas o Product
Owner tem o autoridade para cancelar o Sprint, embora ele ou ela possa estar sob
influência do interessados, a Equipe de Desenvolvimento ou o Scrum Master.

O Sprint será cancelado se o objetivo do Sprint se tornar obsoleto. Isso pode ocorrer se o
a empresa muda de direção ou se as condições de mercado ou tecnologia mudarem. Em geral, o
Sprint deve ser cancelado se não fizer mais sentido, dadas as circunstâncias. Mas, devido
ao curto duração de Sprints, o cancelamento raramente faz sentido.

\section{Q2}
\label{sec:org7d4cea7}
The Sprint Retrospective is an opportunity for the Scrum Team to inspect itself and create
a plan for improvements to be enacted during the next Sprint.  The Sprint Retrospective
occurs after the Sprint Review and prior to the next Sprint Planning.

\section{Q3}
\label{sec:orgc69ac24}
Self-organizing teams choose how best to accomplish their work, rather than being
directed by others outside the team. Cross-functional teams have all competencies needed
to accomplish the work without depending on others not part of the team.

\section{Q4}
\label{sec:org274a209}
Algumas práticas de Scrum estavam no caminho do progresso do Spotify. Assim, eles
fizeram essas práticas opcionais. Após isso, a metodologia ágil importava mais que o
Scrum e princípios importavam mais que práticas.

\section{Q5}
\label{sec:org428b89f}
Sempre que houver uma interrupção significativa de qualquer um dos sistemas de produção,
ou um acidente semelhante, as pessoas envolvidas são obrigadas a escrever um documento
\emph{post-mortem}. Este documento descreve o incidente, incluindo título, resumo, impacto,
linha do tempo, causa (s) raiz (es), o que funcionou / o que não funcionou e itens de
ação. O foco está nos problemas, e como evitá-los no futuro, não no pessoas ou
atribuindo culpa.

\section{Q6}
\label{sec:org49e8a83}
\begin{itemize}
\item Seu projeto não é muito urgente, muito complexo ou novo
\item Sua equipe não é auto-organizada e não tem desenvolvedores profissionais
\item Seu cliente requer documentação clara de cada ciclo de desenvolvimento
\item Seu cliente requer aprovações em cada estágio de desenvolvimento
\item Seu cliente quer que você use a metodologia tradicional e não deseja saber mais sobre o Agile
\item Sua organização não investe na disseminação de práticas ágeis entre desenvolvedores, testadores e gerenciamento
\end{itemize}
\end{document}
